
{
    "content": "Manage Cookie Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. categories start Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. categories end Manage options (https://futurpreneur.ca/en/privacy-policy/#cmplz-manage-consent-container) Manage services (https://futurpreneur.ca/en/privacy-policy/#cmplz-cookies-overview) Manage {vendor_count} vendors (https://futurpreneur.ca/en/privacy-policy/#cmplz-tcf-wrapper) Read more about these purposes (https://cookiedatabase.org/tcf/purposes/) Accept Deny View preferences Save preferences View preferences (https://futurpreneur.ca/en/privacy-policy/#cmplz-manage-consent-container) Privacy policy (https://futurpreneur.ca/en/privacy-policy/) Privacy policy (https://futurpreneur.ca/en/privacy-policy/) Contact us (https://futurpreneur.ca/en/contact/) Skip to main content (#main-content) React main navigation component container fr (https://futurpreneur.ca/fr/homepage/) Sign in (https://route.futurpreneur.ca/_forms/default.aspx?ReturnUrl=%2f_layouts%2f15%2fAuthenticate.aspx%3fSource%3d/en-ca) Who we are For entrepreneurs For mentors Our resources Our programs Our communities End Sample React Component Empowering Indigenous entrepreneurs Indigenous Peoples were the first entrepreneurs of Turtle Island. They continue to thrive to this day. Futurpreneur highlights Indigenous founders strengthening their communities and reaching new heights. Learn more (https://futurpreneur.ca/en/explore/ipm/?utm_source=offline&utm_medium=display&utm_campaign=IESP_Offline_Display_Transit_IPM24) Start and succeed with Pride During Pride Season, Futurpreneur highlights young entrepreneurs from the 2SLGBTQIA+ community. Learn more (https://futurpreneur.ca/en/explore/pride/) Gain access to up to $60,000 in startup loans A collateral-free Futurpreneur loan, with additional financing from BDC, can help you start or buy a business to reach your goals. Learn more about our loans (https://futurpreneur.ca/offering/core-startup/) Black Entrepreneur Startup Program Black entrepreneurs, ages 18-39, who apply to the BESP, can benefit from startup loan financing and up to two years of mentorship, along with access to resources and networking opportunities. Funded by: Additional loan financing from: Learn more about BESP (https://futurpreneur.ca/offering/black-entrepreneur-startup/) Funded by: Additional loan financing from: Thinking about mentoring? Imagine if someone had given you a blueprint to entrepreneurial success. Futurpreneur mentors provide advice, as well as support and encouragement, to help young entrepreneurs achieve their goals. Become a mentor (https://futurpreneur.ca/become-a-mentor/) Indigenous Entrepreneur Startup Program Indigenous founders, ages 18-39, can benefit from loans and mentorship, alongside support from an all-Indigenous team. Learn more about IESP (https://futurpreneur.ca/offering/indigenous-entrepreneur-startup/) 1 / 6 Empowering Indigenous entrepreneurs Start and succeed with Pride Gain access to up to $60,000 in startup loans Black Entrepreneur Startup Program Thinking about mentoring? Indigenous Entrepreneur Startup Program 14,700+ businesses supported $219 million in start-up loans provided to Futurpreneur-supported businesses We’re here to help Futurpreneur has helped more than 18,700 young entrepreneurs, across Canada, launch their small businesses – and you could be next. We're here to partner with you on your journey to success. We provide resources to empower you at every step of your entrepreneurial journey. From financial support to mentorship, business planning to marketing strategy, we can help you realize your startup dream. Launch your business Turn your business idea into reality with Futurpreneur. Mentor an entrepreneur Share your knowledge and help a young entrepreneur succeed. Resources Get marketing tips, write a business plan, master cash flows and more. Build your network Join a growing community of diverse, young entrepreneurs and experts across Canada. Our core offerings For entrepreneurs For Black entrepreneurs For Indigenous entrepreneurs For side hustle entrepreneurs For entrepreneurs Futurpreneur’s Core Startup Program supports young Canadian entrepreneurs with up to $60,000 in accessible financing, mentoring, and tools to help you succeed. Core startup program (https://futurpreneur.ca/offering/core-startup/) Paulo Trindade Paulo's Cake Shop | Toronto, ON Futurpreneur success stories So many young entrepreneurs who are Indigenous can find it a bit daunting to approach an organization they don’t know much about, right? But, I tell them, Futurpreneur really made an effort. I felt my message and my business idea were very well-received. I got a lot of feedback, a lot of encouragement. I felt welcome. Lorne Blesse Jr. Kiwetin Clothing | John D’Or Prairie, Alberta STORIES SHOULDN'T LINK OUT IN V1 <a href=\"https://futurpreneur.ca/en/success_story/lorne-blesse-jr/\" class=\"testimonial-slider__link\"> Read the full story </a> Because the people at Futurpreneur are passionate about the future of entrepreneurship within the country, they believe that entrepreneurs have the power to change the world. Joanna Griffiths Knix and Kt by Knix | Toronto, Ontario STORIES SHOULDN'T LINK OUT IN V1 <a href=\"https://futurpreneur.ca/en/success_story/joanna-griffiths/\" class=\"testimonial-slider__link\"> Read the full story </a> Futurpreneur is very close to my heart, not just because it gave me the money I needed, but because it promotes entrepreneurship. They understand how important small business is to our society and how many people’s lives are touched by it. Elle AyoubZadeh Zvelle | Toronto, Ontario STORIES SHOULDN'T LINK OUT IN V1 <a href=\"https://futurpreneur.ca/en/success_story/elle-ayoubzadeh/\" class=\"testimonial-slider__link\"> Read the full story </a> Futurpreneur provides financial support, but the team cares about me beyond my startup. They invested and encouraged me to succeed, and for that I am very grateful. Nathon Kong La Maison Nathon Kong | Montreal, Quebec STORIES SHOULDN'T LINK OUT IN V1 <a href=\"https://futurpreneur.ca/en/success_story/nathon-kong/\" class=\"testimonial-slider__link\"> Read the full story </a> Inclusive impact at scale first section Futurpreneur's impact supporting young entrepreneurs since 1996 Read more about Futurpreneur (https://futurpreneur.ca/about-us/) 18,700 + diverse young entrepreneurs supported $219M provided in loan capital 14,700+ businesses launched across every province and territory even sections odd sections Supported by (https://canada.ca) (https://canada.ca) (https://www.bdc.ca) (https://www.bdc.ca) (https://www.rbcroyalbank.com) (https://www.rbcroyalbank.com) As a national organization, Futurpreneur honours and acknowledges the traditional and ancestral territories of First Nations, Métis, and Inuit peoples across the country. Read the full Land Acknowledgement (https://futurpreneur.ca/en/land-acknowledgement/) (https://futurpreneur.ca/en/land-acknowledgement/) Contact us (https://futurpreneur.ca/en/contact/) Accessibility (https://futurpreneur.ca/en/accessibility/) Financial statements (https://futurpreneur.ca/en/financial-statements/) FAQ (https://futurpreneur.ca/en/faq/) Careers (https://futurpreneur.ca/en/careers/) (https://www.instagram.com/futurpreneur) (https://www.instagram.com/futurpreneur) (https://www.linkedin.com/company/futurpreneur-canada) (https://www.linkedin.com/company/futurpreneur-canada) (https://twitter.com/Futurpreneur) (https://twitter.com/Futurpreneur) (https://www.youtube.com/user/CYBF) (https://www.youtube.com/user/CYBF) (https://www.facebook.com/Futurpreneur) (https://www.facebook.com/Futurpreneur) Privacy policy (https://futurpreneur.ca/en/privacy-policy/) Futurpreneur cookie policy (https://futurpreneur.ca/en/cookie-policy/) © 2024 Futurpreneur. All rights reserved. Manage consent",
    "metadata": {
        "url": "http://www.futurpreneur.ca/"
    }
}