{
    "content": "Skip to content (#main) Linkedin Twitter Facebook Instagram YouTube Google Reviews Pinterest data-section=\"header_social\" Phone 1-888-599-3111 data-section=\"header_contact\" data-section=\"header_divider\" Contact Us (/contact) data-section=\"header_html2\" data-section=\"title_tagline\" Government Funding Expand Funding List (https://www.mentorworks.ca/government-funding/) Sort by Region (https://www.mentorworks.ca/government-funding/funding-regions/) Sort by Activity (https://www.mentorworks.ca/government-funding/funding-activities/) Sort by Industry (https://www.mentorworks.ca/industries-we-serve/) Resources Expand Funding Resources (https://www.mentorworks.ca/funding-resources/) Funding Videos (https://www.mentorworks.ca/funding-videos/) Funding FAQs (https://www.mentorworks.ca/funding-resources/faqs/) Hiring Resources (https://www.mentorworks.ca/hiring-resources/) Startup Resources (https://www.mentorworks.ca/startup-resources/) News (https://www.mentorworks.ca/news/) Events (https://www.mentorworks.ca/events/) About Expand Our Process (https://www.mentorworks.ca/our-process/) Our Team (https://www.mentorworks.ca/team/) Testimonials (https://www.mentorworks.ca/our-process/testimonials/) Careers (https://www.mentorworks.ca/jobs-page-mentor-works/) Contact Us (https://www.mentorworks.ca/contact/) Phone 1-888-599-3111 (tel:18885993111) Do I Qualify? (https://web.mentorworks.ca/contact-funding) #site-navigation data-section=\"primary_navigation\" Do I Qualify? (/get-funding-help) data-section=\"header_button\" Search data-section=\"header_search\" data-section=\"title_tagline\" Toggle Menu data-section=\"mobile_trigger\" Search data-section=\"header_search\" #masthead .post-thumbnail Government Funding (https://www.mentorworks.ca/blog/government-funding/) .entry-taxonomies Top Atlantic Canada Grant & Loan Funding Programs By Alena Barreca (https://www.mentorworks.ca/author/alena-barreca/) July 22, 2024 July 22, 2024 Reading Time: 5 minutes .entry-meta .entry-header Eligible businesses located in Atlantic Canada can access government funding programs (https://www.mentorworks.ca/government-funding/) to support a wide range of strategic growth projects, including business expansion, capital investment, hiring and training, and research and development. Canadian grant and loan programs are available for businesses in the Atlantic provinces, including New Brunswick, Prince Edward Island, Nova Scotia, and Newfoundland and Labrador. By being proactive and applying for funding prior to the start of a project, businesses can access government grants and loans that boost company investments and greatly improve desired outcomes. Browse this blog and/or visit our Atlantic Canada Funding Directory (https://www.mentorworks.ca/government-funding/funding-regions/atlantic/) to learn more about which government funding programs are currently available for Atlantic Canada businesses. Targeted Canadian Grant Programs for Atlantic Businesses Canada-New Brunswick Job Grant (CNBJG) The Canada-New Brunswick Job Grant (CNBJG) (https://www.mentorworks.ca/government-funding/human-resources-and-training/canada-new-brunswick-job-grant-cnbjg/) is a government program that provides training grants to New Brunswick employers. Through the CNBJG, businesses may receive non-repayable funding to purchase third-party business training programs, including training for in-demand skillsets. The selected training may be delivered to new and existing team members and must improve the employability and value employees can provide. Eligible New Brunswick businesses can receive grants of 66% of training costs (i.e. course, exams, textbooks, software, etc.) up to a maximum of $10,000 per trainee. For all eligibility details, including how to apply, visit the CNBJG program page (https://www.mentorworks.ca/government-funding/human-resources-and-training/canada-new-brunswick-job-grant-cnbjg/) . Canada-Newfoundland Job Grant (CNJG) The Canada-Newfoundland Job Grant (CNJG) (https://www.mentorworks.ca/government-funding/human-resources-and-training/canada-newfoundland-job-grant-cnjg/) is a government funding program that offers training grants to Newfoundland employers. Through the CNJG, businesses may receive grants for third-party business training programs that directly improve business performance and employability of new and existing hires. CNJG grants offset up to 66% to a maximum $10,000 per trainee for training programs focused on advancing skills in areas such as communication, leadership, project management, technology, software, marketing, sales, safety, planning, and much more. For all eligibility details, including how to apply, visit the CNJG program page (https://www.mentorworks.ca/government-funding/human-resources-and-training/canada-newfoundland-job-grant-cnjg/) . Canada-Nova Scotia Job Grant (CNSJG) The Canada-Nova Scotia Job Grant (CNSJG) (https://www.mentorworks.ca/government-funding/human-resources-and-training/canada-nova-scotia-job-grant-cnsjg/) is a Nova Scotia government funding program that offers training grants to employers. Through the program, companies may receive non-repayable funding from the government to purchase third-party business training programs, including training for in-demand skillsets. Eligible applicants can access grants of 66% of costs up to a maximum of $10,000 per trainee for advanced training programs that provide new and existing hires with in-demand skills. For all eligibility details, including how to apply, visit the CNSJG program page (https://www.mentorworks.ca/government-funding/human-resources-and-training/canada-nova-scotia-job-grant-cnsjg/) . Canada-Prince Edward Island Job Grant (CPEIJG) The Canada-Prince Edward Island Job Grant (CPEIJG) (https://www.mentorworks.ca/government-funding/human-resources-and-training/canada-prince-edward-island-job-grant-cpeijg/) is a government grant that provides funding for training to Prince Edward Island employers. Through the program, eligible businesses may receive non-repayable grants to deliver third-party business training to improve the employability and value that employees can provide. CPEIJG offers non-repayable grant contributions of 66% of training costs (i.e. course, exams, textbooks, software resources, etc.) up to a max limit of $10,000 per trainee. For all eligibility details, including how to apply, visit the CPEIJG program page (https://www.mentorworks.ca/government-funding/human-resources-and-training/canada-prince-edward-island-job-grant-cpeijg/) . Federal Grants and Loans for Atlantic Canada Businesses CanExport The CanExport Program (https://www.mentorworks.ca/government-funding/business-expansion/canexport/) provides government support for Canadian export projects including international expansion initiatives such as developing marketing materials for international audiences and completing foreign market research. By accessing additional funding for these types of activities, businesses can de-risk export market expansion plans. Eligible applicants can access up to 50% funding to a maximum $50,000 grant per project by utilizing the CanExport government funding program. For all eligibility details, including how to apply, visit the CanExport program page (https://www.mentorworks.ca/government-funding/business-expansion/canexport/) . Canada Small Business Financing Program The Canada Small Business Financing Program (https://www.mentorworks.ca/government-funding/business-expansion/canada-small-business-financing-program/) is part of Canada’s Small Business Financing Act strategy and was established to help support business growth through business loans with competitive interest rates. For-profit Canadian businesses with an annual gross revenue of under $10M can access up to $1M for business expansion activities, including the acquisition of a building, leasehold improvements, purchasing new or used equipment, and software components. For all eligibility details, including how to apply, visit the Canada Small Business Financing Program page (https://www.mentorworks.ca/government-funding/business-expansion/canada-small-business-financing-program/) . Canada Summer Jobs (CJG) The Canada Summer Jobs (CJG) (https://www.mentorworks.ca/government-funding/human-resources-and-training/canada-summer-jobs/) program is a government grant program that provides support for employers offering supervised career-related work experience to youth employees. The experiences gained through student placements should further develop an applicant’s skills and knowledge, preparing them to make a transition into full-time career employment. Public and private sector employers can receive hiring grants for up to 50% of an employee’s minimum hourly rate. Non-profits can receive grants for up to 100% of minimum wage plus Mandatory Employment Related Costs (MERCs). This amount is limited at a maximum $300,000 per employer/province or territory. Maximum 40 hours/week/employee can be included. For all eligibility details, including how to apply, visit the Canada Summer Jobs (CJG) program page (https://www.mentorworks.ca/government-funding/human-resources-and-training/canada-summer-jobs/) . Industrial Research Assistance Program (IRAP) (https://www.mentorworks.ca/government-funding/research-development/nrc-irap-research-grants/) The Industrial Research Assistance Program (IRAP) (https://www.mentorworks.ca/government-funding/research-development/nrc-irap-research-grants/) was established to accelerate innovative research and development projects in Canada. Eligible businesses who are developing and applying process improvements are the primary targets to receive research funding contributions through IRAP, but large-scale technology adoption projects that lead to new capabilities and/or processes are also considered. Eligible businesses can access contributions of up to 60-80% of internal technical labour and subcontractor expenses towards a specified innovation project. For all eligibility details, including how to apply, visit the IRAP program page (https://www.mentorworks.ca/government-funding/research-development/nrc-irap-research-grants/) . Strategic Innovation Fund (SIF) The Strategic Innovation Fund (SIF) (https://www.mentorworks.ca/government-funding/capital-investment/strategic-innovation-fund/) is a Canadian program created to provide funding for Canada’s industrial and technology sectors. SIF offers a combination of both grants and loans which can be valued at up to 50% of eligible project costs with the goal of promoting investment that drive sustained productivity and economic benefits. The amount and type of financial support offered by SIF is allocated on a case-by-case basis as determined by the SIF funding application review committee. SIF offers financial contributions (both grants and loans) valued at up to 50% of project costs. The program focuses on projects requesting at least $10 million in contributions. This means a minimum project size of $20 million. For all eligibility details, including how to apply, visit the Strategic Innovation Fund (SIF) program page (https://www.mentorworks.ca/government-funding/capital-investment/strategic-innovation-fund/) . Government Funding Can Help Meet Your Business Goals If you are a Canadian business located in Atlantic Canada and you are looking to get started with government grants and/or loans to assist you in meeting your project goals , please contact the Mentor Works team (https://www.mentorworks.ca/contact/) of professional grant writers to help with program assessment and eligibility. Canadian businesses should understand that there are key differences between the types of funding which is available before they begin an application process. Download our free Types of Government Funding resource (https://web.mentorworks.ca/funding-types) to learn about the various types of grants, loans, and government incentives that are available to Canadian companies, organizations, and entrepreneurs. HubSpot Call-to-Action Code end HubSpot Call-to-Action Code .entry-content Post Tags: # Federal Funding (https://www.mentorworks.ca/tag/federal-funding/) # Funding in Atlantic Canada (https://www.mentorworks.ca/tag/funding-in-atlantic-canada/) # Government Grants (https://www.mentorworks.ca/tag/government-grants/) # New Brunswick Provincial Funding (https://www.mentorworks.ca/tag/new-brunswick-provincial-funding/) # Newfoundland and Labrador Provincial Funding (https://www.mentorworks.ca/tag/newfoundland-and-labrador-provincial-funding/) # Nova Scotia Provincial Funding (https://www.mentorworks.ca/tag/nova-scotia-provincial-funding/) # Prince Edward Island Provincial Funding (https://www.mentorworks.ca/tag/prince-edward-island-provincial-funding/) .entry-tags .entry-footer #post-48742 Post navigation Previous Previous Accelerating Automotive Innovation: A Guide for Manufacturers (https://www.mentorworks.ca/blog/business-strategy/accelerating-automotive-innovation-a-guide/) Next Continue Ontario’s $5.5 Million Boost to Life Sciences (https://www.mentorworks.ca/blog/success-stories/ontario-investing-15m-into-life-sciences/) Leave a Reply Cancel reply (/blog/government-funding/top-atlantic-canada-business-grants-and-loans/#respond) Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Δ #respond #comments #main #primary [element-6442] [/element-6442] #inner-wrap Quick Links Home (https://www.mentorworks.ca/) Government Funding (https://www.mentorworks.ca/government-funding/) Resources (https://www.mentorworks.ca/funding-resources/) Events (https://www.mentorworks.ca/events/) About Mentor Works (https://www.mentorworks.ca/our-process/) Funding News (https://www.mentorworks.ca/news/) Contact Us (https://www.mentorworks.ca/contact/) .footer-widget1 Latest Funding News Boost Your Business with Canadian R&D Funding (https://www.mentorworks.ca/blog/business-strategy/canadian-rd-funding-opportunities/) Ontario’s $5.5 Million Boost to Life Sciences (https://www.mentorworks.ca/blog/success-stories/ontario-investing-15m-into-life-sciences/) Top Atlantic Canada Grant & Loan Funding Programs (https://www.mentorworks.ca/blog/government-funding/top-atlantic-canada-business-grants-and-loans/) Subscribe to Funding News .footer-widget2 Search Website Content Search for: Search Upcoming Event 04 Sep Top Canadian Government Funding Programs for Fall 2024 (https://web.mentorworks.ca/wbn-2024-09-04-funding-for-fall-2024) Wednesday , Webinar Register (https://web.mentorworks.ca/wbn-2024-09-04-funding-for-fall-2024) No event found! .footer-widget3 Linkedin Twitter Facebook Instagram YouTube Google Reviews Pinterest data-section=\"footer_social\" © 2024 Mentor Works .site-info #colophon Government Funding (https://www.mentorworks.ca/government-funding/) Toggle child menu Expand Funding List (https://www.mentorworks.ca/government-funding/) Sort by Region (https://www.mentorworks.ca/government-funding/funding-regions/) Sort by Activity (https://www.mentorworks.ca/government-funding/funding-activities/) Sort by Industry (https://www.mentorworks.ca/industries-we-serve/) Resources (https://www.mentorworks.ca/funding-resources/) Toggle child menu Expand Funding Resources (https://www.mentorworks.ca/funding-resources/) Funding Videos (https://www.mentorworks.ca/funding-videos/) Funding FAQs (https://www.mentorworks.ca/funding-resources/faqs/) Hiring Resources (https://www.mentorworks.ca/hiring-resources/) Startup Resources (https://www.mentorworks.ca/startup-resources/) News (https://www.mentorworks.ca/news/) Events (https://www.mentorworks.ca/events/) About (https://www.mentorworks.ca/our-process/) Toggle child menu Expand Our Process (https://www.mentorworks.ca/our-process/) Our Team (https://www.mentorworks.ca/team/) Testimonials (https://www.mentorworks.ca/our-process/testimonials/) Careers (https://www.mentorworks.ca/jobs-page-mentor-works/) Contact Us (https://www.mentorworks.ca/contact/) Phone 1-888-599-3111 (tel:18885993111) Do I Qualify? (https://web.mentorworks.ca/contact-funding) #site-navigation data-section=\"mobile_navigation\" Toggle Menu Close Search for: Search",
    "metadata": {
        "url": "https://www.mentorworks.ca/blog/government-funding/top-atlantic-canada-business-grants-and-loans/"
    }
}