
{
    "content": "Ontario.ca needs JavaScript to function properly and provide you with a fast, stable experience. To have a better experience, you need to: Go to your browser's settings Enable JavaScript (/page/government-ontario) Ontario.ca homepage (/page/government-ontario) (/page/government-ontario) (/page/government-ontario) Search Français (/fr/page/emploi-ontario) fr (/fr/page/emploi-ontario) Search Menu close Menu Arts and culture (https://www.ontario.ca/page/arts-and-culture) Business and economy (https://www.ontario.ca/page/business-and-economy) COVID-19 (https://www.ontario.ca/covid) Driving and roads (https://www.ontario.ca/page/driving-and-roads) Education and training (https://www.ontario.ca/page/education-and-training) Environment and energy (https://www.ontario.ca/page/environment-and-energy) Government (https://www.ontario.ca/page/government) Health and wellness (https://www.ontario.ca/page/health-care-ontario) Home and community (https://www.ontario.ca/page/home-and-community) Jobs and employment (https://www.ontario.ca/page/jobs-and-employment) Law and safety (https://www.ontario.ca/page/law-and-safety) Rural and north (https://www.ontario.ca/page/rural-and-north) Taxes and benefits (https://www.ontario.ca/page/taxes-and-benefits) Travel and recreation (https://www.ontario.ca/page/travel-and-recreation) Home (/page/government-ontario) Jobs and employment (/page/jobs-and-employment) Employment Ontario We help job seekers, workers and employers with advice, grants and other services around public and private sector employment. Find a job (#find-a-job) Find, hire and train workers (#find-workers) On this page Skip this page navigation (#toc-end) Find a job (#section-0) Build skills and retrain (#section-1) Find, hire and train workers (#section-2) Get help from a counsellor (#section-3) Other government services (#section-4) Contact Employment Ontario (#section-5) Find a job Find a job across Ontario Examples: nurse in Guelph / part-time clerk Windsor Selecting search will take you to the Ontario Job Bank Search Find an apprenticeship in Ontario Train for a career in one of over 100 skilled trades and get paid while you learn (/page/start-apprenticeship) Resources for job seekers Find an employment service or training provider in your area to help you find work or training (https://feat.findhelp.ca/) Find summer jobs for high school, university and college students (/page/summer-jobs-students) Build skills and retrain Find adult learning courses to prepare for new jobs, training or further education (/page/adult-learning) Get help to pay living expenses and tuition for job training or postsecondary education (Better Jobs Ontario, formerly Second Career) (/page/better-jobs-ontario) Find, hire and train workers Post a job for free You will need your payroll account number This button will take you to the Ontario Job Bank Post a job (https://on-employer.jobbank.gc.ca/employer/login) Resources for employers Find funding to help businesses pay for training of current or onboarding employees (Canada-Ontario Job Grant) (https://www.tcu.gov.on.ca/eng/eopg/cojg/) Hire an apprentice in one of over 100 skilled trades (/page/hire-apprentice) Get financial support when you hire a young worker (/page/hire-young-person) Get support to help your workers adjust after job loss (50 or more employees) (/page/adjusting-after-job-loss) Sponsor work opportunities for job seekers (Job creation partnerships) (/page/ontario-job-creation-partnerships) Get funding to address challenges to hiring, training and retaining workers (/page/skills-development-fund) Get help from a counsellor Workers and job seekers can make a free appointment to speak with an employment counsellor to help you develop career goals, prepare for interviews or start a job. Speak with an employment counsellor in: Northern Ontario and City of Toronto (https://www.eoss.tcu.gov.on.ca/CitizenPortal/infoAboutYou.do?programCode=ESI&lang=en) regions any other region (https://www.eoss.tcu.gov.on.ca/CitizenPortal/infoAboutYou.do?programCode=EAP&lang=en) Employers can make a free appointment to speak with an employment counsellor to get advice about attracting and recruiting the right employees and find financial incentives to offset on-the-job training costs. You can also get advice about managing your workforce during restructuring. Speak with an employment counsellor in: Northern Ontario and City of Toronto (https://www.eoss.tcu.gov.on.ca/CitizenPortal/infoAboutYou.do?programCode=ESE&lang=en) regions any other region (https://www.eoss.tcu.gov.on.ca/CitizenPortal/infoAboutYou.do?programCode=EAP&lang=en) Other government services Employment Insurance benefits for workers who have lost their job (https://www.canada.ca/en/services/benefits/ei.html) Ontario Student Assistance Program ( (/page/osap-ontario-student-assistance-program) OSAP) helps you pay for post-secondary school (/page/osap-ontario-student-assistance-program) Ontario Works: Support for those not qualifying for Employment Insurance (/page/ontario-works) Ontario Disability Support Program ( (/page/ontario-disability-support-program) ODSP ): Support for people with disabilities (/page/ontario-disability-support-program) Moving from another province to Ontario for work (http://www.workersmobility.ca/workers/) Moving to Ontario from outside Canada (/page/work-your-profession-or-trade) Ontario construction contractors and workers wanting to work in Quebec (Jobs Protection Office) (/page/working-construction-ontario-and-quebec) Workplace Safety and Insurance Board ( (https://www.wsib.ca/en/contact-us) WSIB ) (https://www.wsib.ca/en/contact-us) Contact Employment Ontario Monday to Friday 8:30 am to 5:00 pm ET Tel : 416-326-5656 (tel:+14163265656) Toll-free: 1-800-387-5656 (tel:+18003875656) TTY : 1-866-533-6339 (tel:+18665336339) Chat Live (/page/employment-ontario-live-chat) contactEO@ontario.ca (mailto:contactEO@ontario.ca) Updated: July 22, 2024 Published: June 24, 2016 (https://www.ontario.ca/page/employment-ontario) Employment Ontario (https://www.ontario.ca/page/employment-ontario) Employment Ontario can help you get the training, skills and experience you need to achieve your goals. We connect people looking for work with employers looking for workers, and have locations across the province to help with job search and employment and training opportunities. Questions or comments There are many ways to contact the Government of Ontario. Contact us (/feedback/contact-us?id=73740&nid=73496) About Ontario (https://www.ontario.ca/page/about-ontario) Accessibility (https://www.ontario.ca/page/accessibility) News (http://news.ontario.ca/newsroom/en) Privacy (https://www.ontario.ca/page/privacy-statement) Terms of use (https://www.ontario.ca/page/terms-use) © King’s Printer for Ontario, 2012 (https://www.ontario.ca/page/copyright-information) – to 24 (https://www.ontario.ca/page/copyright-information)",
    "metadata": {
        "url": "https://www.ontario.ca/page/employment-ontario"
    }
}